# GetWallClosureGroup

## Description
Returns the handle to the wall closure group of an object.

```pascal
FUNCTION GetWallClosureGroup(hObject : HANDLE): HANDLE;
```

```python
def vs.GetWallClosureGroup(hObject):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|Handle to the object containing the wall closure group|

## See Also
VS Functions:
SetWallClosureGroup

## Version
Availability: from Vectorworks 2022

## Category
* Objects - Custom